# Cuaderno Pr√°ctico de SQL: De DDL a Funciones de Ventana

¬°Bienvenido! Este cuaderno es el taller pr√°ctico que acompa√±a nuestro curso. Aqu√≠ no solo ver√°s c√≥digo, sino que entender√°s el **"porqu√©"** de cada comando. Pasaremos de ser arquitectos de datos (con DDL) a operadores y analistas expertos (con DML y consultas avanzadas).

**Nuestra Misi√≥n:**
Vamos a simular la creaci√≥n y gesti√≥n de la base de datos de una peque√±a empresa. Usaremos dos herramientas clave que viven dentro de este entorno de Python:

* **`sqlite3`**: Piensa en esto como un motor de base de datos completo, pero contenido en un solo archivo. Es como tener un
laboratorio de bases de datos personal y port√°til, perfecto para aprender y experimentar sin necesidad de instalar un servidor complejo.
* **`pandas`**: Es el est√°ndar de oro en la ciencia de datos con Python. Lo usaremos para visualizar los resultados de nuestras consultas de una manera limpia y ordenada, como si estuvi√©ramos viendo una hoja de c√°lculo.

¬°Empecemos!

**M√≥dulos que cubriremos:**
1.  **Configuraci√≥n del Entorno**
2.  **DDL (Data Definition Language):** Creando la estructura.
3.  **DML (Data Manipulation Language):** Interactuando con los datos.
4.  **Consultas Avanzadas:** `JOIN`, `CTE` y Funciones de Ventana.

In [ ]:
# ===================================================================
# PASO 1: CONFIGURACI√ìN DE NUESTRO LABORATORIO
# ===================================================================

import sqlite3
import pandas as pd

# Imagina que 'conectar' a una base de datos es como abrir la puerta de una bodega.
# Si el archivo 'empresa.db' no existe, Python lo crea por nosotros.
# Si ya existe, simplemente abrimos la puerta para trabajar con lo que hay adentro.

conn = sqlite3.connect('../Datos/empresa.db') ## Archivo BODEGA DE DATOS db(DataBase) - montar tablas

In [2]:
# El 'cursor' es nuestro operario o nuestro "brazo rob√≥tico" dentro de la bodega.
# No podemos mover las cajas (datos) directamente; le damos √≥rdenes al cursor
# y √©l las ejecuta por nosotros.
cursor = conn.cursor()

In [11]:
# --- Funci√≥n Auxiliar M√°gica ---
# Para no repetir c√≥digo, creamos una funci√≥n que toma una orden (nuestra consulta SQL),
# se la pasa al operario (el cursor), recoge los resultados y nos los muestra
# en una tabla bonita y f√°cil de leer (un DataFrame de pandas).
def ejecutar_sql(query, conexion=conn):
  """
  Toma una consulta SQL, la ejecuta y devuelve el resultado
  en una tabla de pandas para una visualizaci√≥n clara.
  """
  df = pd.read_sql_query(query, conexion)
  # Usamos display() porque en Colab presenta las tablas de forma m√°s elegante.
  display(df)

print("‚úÖ ¬°Laboratorio configurado! La puerta a 'empresa.db' est√° abierta y nuestro operario est√° listo.")

‚úÖ ¬°Laboratorio configurado! La puerta a 'empresa.db' est√° abierta y nuestro operario est√° listo.

## **2. DDL (Data Definition Language): El Arquitecto de Datos**

Ha llegado el momento de ponernos el casco de arquitecto. Con DDL, no manipulamos datos, sino que construimos las "habitaciones" y "estructuras" donde vivir√°n esos datos. Definiremos los planos de nuestras tablas, especificando qu√© tipo de informaci√≥n guardar√° cada columna y c√≥mo se relacionar√°n entre s√≠.

* **`CREATE TABLE`**: Es nuestro comando para levantar los cimientos. Definimos el nombre de la tabla y el plano de cada columna: su nombre (`nombre_depto`), el tipo de dato que almacenar√° (`TEXT`, `INTEGER`, `REAL`) y las reglas que debe seguir (`PRIMARY KEY`, `NOT NULL`, `FOREIGN KEY`).
* **`ALTER TABLE`**: ¬°El mundo cambia! Nuestra aplicaci√≥n crece y nos damos cuenta de que necesitamos guardar m√°s informaci√≥n. `ALTER TABLE` es la herramienta para hacer una "remodelaci√≥n": a√±adir una nueva columna, cambiar el nombre de una existente o agregar una nueva regla sin tener que demoler toda la tabla.
* **`DROP TABLE`**: Este es el bot√≥n de demolici√≥n. √ösalo con un respeto y un miedo saludables. `DROP` no solo borra los datos, sino que elimina por completo la tabla y su estructura del mapa de la base de datos. No hay un "ctrl+z" f√°cil para esto.

In [4]:
# ===================================================================
# PASO 2: EJECUTANDO COMANDOS DDL - CREAR ESTRUCTURAS PARA MONTAR LOS DATOS
# ===================================================================

# Usamos cursor.execute() porque estamos dando √≥rdenes de construcci√≥n,
# no pidiendo que nos traigan datos para ver.

# 2.1. CREATE TABLE: Definiendo los planos.
# La Clave Primaria (PRIMARY KEY) es el DNI de cada fila: √∫nica e irrepetible.
# La Clave For√°nea (FOREIGN KEY) es el pegamento que une nuestras tablas. Le dice
# a la columna 'id_depto' de Empleados que su valor DEBE existir en la columna
# 'id_depto' de la tabla Departamentos. ¬°As√≠ mantenemos la integridad!
print("üèóÔ∏è  Levantando las estructuras de las tablas...")

cursor.execute("""
CREATE TABLE IF NOT EXISTS Departamentos (
    id_depto INTEGER PRIMARY KEY,
    nombre_depto TEXT NOT NULL UNIQUE,
    region TEXT
);
""")

üèóÔ∏è  Levantando las estructuras de las tablas...

In [12]:
ejecutar_sql("Select * FROM Departamentos") # DATA SET VACIO y no se da cuenta los tipos de datos en pyhton (pandas)

Empty DataFrame
Columns: [id_depto, nombre_depto, region]
Index: []

In [13]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS Empleados (
    id_empleado INTEGER PRIMARY KEY,
    nombre TEXT NOT NULL,
    apellido TEXT,
    salario REAL CHECK(salario > 0),
    id_depto INTEGER,
    FOREIGN KEY (id_depto) REFERENCES Departamentos(id_depto)
);
""")

In [16]:
# 2.2. ALTER TABLE: Una peque√±a remodelaci√≥n.
# Nos dimos cuenta de que es crucial saber cu√°ndo se uni√≥ un empleado a la empresa.

## VAYASE A L√ëA TABLA EMPLEADOS Y AGREGUE FECHA DE INGRESO
try:
    print("üõ†Ô∏è  Remodelando la tabla 'Empleados' para agregar la columna 'fecha_ingreso'...")
    cursor.execute("ALTER TABLE Empleados ADD COLUMN fecha_ingreso DATE;") #ALETERE 
except sqlite3.OperationalError as e:
    # Este bloque 'try/except' es para evitar errores si ejecutamos la celda m√°s de una vez.
    print(f"‚ö†Ô∏è  Advertencia: {e}. ¬°Parece que la remodelaci√≥n ya se hab√≠a hecho!")

üõ†Ô∏è  Remodelando la tabla 'Empleados' para agregar la columna 'fecha_ingreso'...
‚ö†Ô∏è  Advertencia: duplicate column name: fecha_ingreso. ¬°Parece que la remodelaci√≥n ya se hab√≠a hecho!

In [ ]:
cursor.execute("ALTER TABLE Empleados ADD COLUMN fecha_ingreso DATE;") # COMO YA ESTA LA FECHA DE INGRESO GENERA ERROR

In [24]:
# ¬°Fundamental! Como en un videojuego, despu√©s de hacer cambios importantes,
# hay que "guardar la partida". conn.commit() escribe permanentemente en el archivo
# de la base de datos todos los cambios estructurales que hemos ordenado.
conn.commit()
print("\n‚úÖ ¬°Planos finalizados y guardados! Las estructuras 'Departamentos' y 'Empleados' est√°n listas.")

‚úÖ ¬°Planos finalizados y guardados! Las estructuras 'Departamentos' y 'Empleados' est√°n listas.

In [17]:
### USO DE DROP

cursor.execute("""
               CREATE TABLE toy (
    id_empleado INTEGER PRIMARY KEY,
    nombre TEXT NOT NULL,
    apellido TEXT,
    salario REAL CHECK(salario > 0),
    id_depto INTEGER,
    FOREIGN KEY (id_depto) REFERENCES Departamentos(id_depto)
    );
               """)

In [21]:
ejecutar_sql("SELECT * FROM toy")

Empty DataFrame
Columns: [id_empleado, nombre, apellido, salario, id_depto]
Index: []

In [22]:
# ELIMINE LA TABLA SI EXISTE

cursor.execute("""
               DROP TABLE IF EXISTS toy
               """)

In [ ]:
ejecutar_sql("SELECT * FROM toy") # VOLVEMOS A EJECUTAR Y YA NO ESTA TOY

## **3. DML (Data Manipulation Language): El Operador de Datos**

Con las estructuras ya firmes, es hora de darles vida. Ahora nos quitamos el casco de arquitecto y nos ponemos el de operador. Con DML, vamos a poblar nuestras tablas, consultar la informaci√≥n y mantenerla actualizada.

* **`INSERT`**: Es el comando para "dar de alta" o registrar nueva informaci√≥n. Llenaremos nuestras habitaciones vac√≠as con los datos de los departamentos y empleados.
* **`SELECT`**: El comando estrella y el mejor amigo del analista. Es nuestra ventana para ver, filtrar, ordenar y hacer preguntas a los datos que hemos guardado.
* **`UPDATE`**: La realidad cambia. Un empleado recibe un aumento, un departamento cambia de nombre... `UPDATE` es el comando para editar registros que ya existen. **¬°La cl√°usula `WHERE` es tu salvavidas aqu√≠!** Sin ella, ¬°actualizar√≠as TODAS las filas de la tabla!
* **`DELETE`**: Es el comando para eliminar registros. Al igual que con `UPDATE`, la cl√°usula `WHERE` es absolutamente cr√≠tica. Olvidarla es como apretar el bot√≥n de "borrar todo" por accidente.

In [25]:
cursor.execute("INSERT INTO Departamentos (id_depto, nombre_depto, region) VALUES (0, 'Analitica', 'Norte')")

In [27]:
cursor.execute("INSERT INTO Departamentos (id_depto, nombre_depto, region) VALUES (10, 'Analitica_2', 'Norte')") # No se puede repetir registros

In [28]:
ejecutar_sql("SELECT * FROM Departamentos")

   id_depto nombre_depto region
0         0    Analitica  Norte
1        10  Analitica_2  Norte

In [29]:
cursor.execute("""INSERT INTO Departamentos (id_depto, nombre_depto, region)
               VALUES
                    (1, 'Ventas', 'Norte'),
                    (2, 'Tecnolog√≠a', 'Central'),
                    (3, 'Recursos Humanos', 'Central'),
                    (4, 'Marketing', 'Sur')""")

In [ ]:
ejecutar_sql("SELECT * FROM Departamentos") ## A√ëADIR VARIOS DATOS AL TIEMPO

   id_depto      nombre_depto   region
0         0         Analitica    Norte
1         1            Ventas    Norte
2         2        Tecnolog√≠a  Central
3         3  Recursos Humanos  Central
4         4         Marketing      Sur
5        10       Analitica_2    Norte

In [31]:
cursor.execute("""DELETE FROM Departamentos""")

In [ ]:
ejecutar_sql("SELECT * FROM Departamentos") ## Borro todo

Empty DataFrame
Columns: [id_depto, nombre_depto, region]
Index: []

In [33]:
# ===================================================================
# PASO 3: EJECUTANDO COMANDOS DML
# ===================================================================

# 3.1. INSERT: Poblando nuestras tablas.
# Usar 'executemany' es como contratar un equipo de mudanza en lugar de mover
# una caja a la vez. Es mucho m√°s eficiente para insertar m√∫ltiples filas.
try:
    print("üöö Insertando datos en 'Departamentos'...")
    deptos = [
        (1, 'Ventas', 'Norte'),
        (2, 'Tecnolog√≠a', 'Central'),
        (3, 'Recursos Humanos', 'Central'),
        (4, 'Marketing', 'Sur')
    ]
    cursor.executemany("INSERT INTO Departamentos (id_depto, nombre_depto, region) VALUES (?, ?, ?)", deptos)

    print("üöö Insertando datos en 'Empleados'...")
    empleados = [
        (1, 'Ana', 'Garc√≠a', 50000, 2, '2022-01-15'),
        (2, 'Luis', 'Mart√≠nez', 75000, 2, '2021-11-20'),
        (3, 'Sof√≠a', 'Hern√°ndez', 45000, 1, '2023-03-01'),
        (4, 'Carlos', 'P√©rez', 48000, 1, '2022-08-10'),
        (5, 'Elena', 'Ruiz', 80000, 2, '2020-05-01'),
        (6, 'Mario', 'Jim√©nez', 35000, 3, '2023-05-15')
    ]
    cursor.executemany("INSERT INTO Empleados (id_empleado, nombre, apellido, salario, id_depto, fecha_ingreso) VALUES (?, ?, ?, ?, ?, ?)", empleados)
    conn.commit()
    print("\n‚úÖ ¬°Datos insertados y guardados con √©xito!")
except sqlite3.IntegrityError:
    print("\n‚ö†Ô∏è  Advertencia: Parece que estos datos ya fueron insertados en una ejecuci√≥n anterior. ¬°No se duplicar√°n gracias a nuestras reglas (constraints)!")

# 3.2. SELECT: Echemos un primer vistazo.
print("\nüîç --- Inspeccionando la tabla Departamentos ---")
ejecutar_sql("SELECT * FROM Departamentos;")

print("\nüîç --- Inspeccionando la tabla Empleados ---")
ejecutar_sql("SELECT * FROM Empleados;")

üöö Insertando datos en 'Departamentos'...
üöö Insertando datos en 'Empleados'...

‚úÖ ¬°Datos insertados y guardados con √©xito!

üîç --- Inspeccionando la tabla Departamentos ---

   id_depto      nombre_depto   region
0         1            Ventas    Norte
1         2        Tecnolog√≠a  Central
2         3  Recursos Humanos  Central
3         4         Marketing      Sur

üîç --- Inspeccionando la tabla Empleados ---

   id_empleado  nombre   apellido  salario  id_depto fecha_ingreso
0            1     Ana     Garc√≠a  50000.0         2    2022-01-15
1            2    Luis   Mart√≠nez  75000.0         2    2021-11-20
2            3   Sof√≠a  Hern√°ndez  45000.0         1    2023-03-01
3            4  Carlos      P√©rez  48000.0         1    2022-08-10
4            5   Elena       Ruiz  80000.0         2    2020-05-01
5            6   Mario    Jim√©nez  35000.0         3    2023-05-15

In [34]:
# ===================================================================
# PASO 3 (CONTINUACI√ìN): MODIFICANDO DATOS
# ===================================================================

# 3.3. UPDATE: Elena Ruiz ha sido promovida. ¬°Aumentemos su salario!
# La cl√°usula WHERE es crucial: nos aseguramos de actualizar SOLO el registro de Elena.
print("‚úçÔ∏è  Actualizando el salario de Elena Ruiz...")
cursor.execute("UPDATE Empleados SET salario = 82500 WHERE id_empleado = 5;")
conn.commit()

print("Verificando la actualizaci√≥n:")
ejecutar_sql("SELECT * FROM Empleados WHERE id_empleado = 5;")

‚úçÔ∏è  Actualizando el salario de Elena Ruiz...
Verificando la actualizaci√≥n:

   id_empleado nombre apellido  salario  id_depto fecha_ingreso
0            5  Elena     Ruiz  82500.0         2    2020-05-01

In [36]:
# 3.4. DELETE: Lamentablemente, Mario Jim√©nez ha dejado la empresa.
# De nuevo, la cl√°usula WHERE nos asegura que solo borremos a Mario.
print("\nüóëÔ∏è  Eliminando al empleado Mario Jim√©nez...")
cursor.execute("DELETE FROM Empleados WHERE id_empleado = 6;")

üóëÔ∏è  Eliminando al empleado Mario Jim√©nez...

In [37]:
conn.commit() ## Permisos para confirmar

print("Verificando la eliminaci√≥n (la tabla no deber√≠a contener a Mario):")
ejecutar_sql("SELECT * FROM Empleados;")

Verificando la eliminaci√≥n (la tabla no deber√≠a contener a Mario):

   id_empleado  nombre   apellido  salario  id_depto fecha_ingreso
0            1     Ana     Garc√≠a  50000.0         2    2022-01-15
1            2    Luis   Mart√≠nez  75000.0         2    2021-11-20
2            3   Sof√≠a  Hern√°ndez  45000.0         1    2023-03-01
3            4  Carlos      P√©rez  48000.0         1    2022-08-10
4            5   Elena       Ruiz  82500.0         2    2020-05-01

In [39]:
ejecutar_sql("SELECT * FROM Empleados;")

   id_empleado  nombre   apellido  salario  id_depto fecha_ingreso
0            1     Ana     Garc√≠a  50000.0         2    2022-01-15
1            2    Luis   Mart√≠nez  75000.0         2    2021-11-20
2            3   Sof√≠a  Hern√°ndez  45000.0         1    2023-03-01
3            4  Carlos      P√©rez  48000.0         1    2022-08-10
4            5   Elena       Ruiz  82500.0         2    2020-05-01

In [ ]:
cursor.execute("DELETE FROM Empleados WHERE id_empleado = 5;") ## Eliminar empleado 5

In [41]:
ejecutar_sql("SELECT * FROM Empleados;")

   id_empleado  nombre   apellido  salario  id_depto fecha_ingreso
0            1     Ana     Garc√≠a  50000.0         2    2022-01-15
1            2    Luis   Mart√≠nez  75000.0         2    2021-11-20
2            3   Sof√≠a  Hern√°ndez  45000.0         1    2023-03-01
3            4  Carlos      P√©rez  48000.0         1    2022-08-10

In [42]:
conn.rollback()

In [ ]:
ejecutar_sql("SELECT * FROM Empleados;") ## volvio el 5

   id_empleado  nombre   apellido  salario  id_depto fecha_ingreso
0            1     Ana     Garc√≠a  50000.0         2    2022-01-15
1            2    Luis   Mart√≠nez  75000.0         2    2021-11-20
2            3   Sof√≠a  Hern√°ndez  45000.0         1    2023-03-01
3            4  Carlos      P√©rez  48000.0         1    2022-08-10
4            5   Elena       Ruiz  82500.0         2    2020-05-01

In [ ]:
nuevos_empleados=[  (6, 'Mario', 'Jim√©nez', 35000, 3, '2023-05-15'), 
                    (7, 'Julio', 'Jaramillo', 80000,8,'2025-01-01')
    ]
cursor.executemany("INSERT INTO Empleados (id_empleado, nombre, apellido, salario, id_depto, fecha_ingreso) VALUES (?, ?, ?, ?, ?, ?)", nuevos_empleados)

ejecutar_sql('SELECT * FROM Empleados')
ejecutar_sql('SELECT * FROM Departamentos')

## **4. Consultas Avanzadas: Donde Ocurre la Magia del An√°lisis**

Ya somos buenos operadores, ahora convirt√°monos en analistas de datos. Aqu√≠ es donde SQL brilla, permiti√©ndonos cruzar informaci√≥n, organizar consultas complejas y realizar c√°lculos sofisticados que van mucho m√°s all√° de una simple selecci√≥n de datos.

* **`JOIN`**: Es el arte de conectar mundos. Si los datos de `Empleados` son un universo y los de `Departamentos` son otro, `JOIN` es el puente que nos permite viajar entre ellos y combinar su informaci√≥n para obtener una visi√≥n completa.
* **`CTE (Common Table Expressions)`**: El mejor amigo de la claridad. Las CTEs, que se inician con `WITH`, nos permiten construir nuestras consultas paso a paso. En lugar de anidar subconsultas creando un "c√≥digo espagueti" ilegible, definimos bloques l√≥gicos y reutilizables. Es como preparar los ingredientes (`mise en place`) antes de cocinar el plato principal.
* **`Funciones de Ventana`**: Esta es la verdadera joya del SQL moderno para el an√°lisis. A diferencia de `GROUP BY` que colapsa las filas en un solo resultado agregado, una funci√≥n de ventana realiza un c√°lculo sobre un conjunto de filas (la "ventana") pero **mantiene intactas las filas originales**. Esto nos permite ver un valor individual y, en la misma fila, un c√°lculo relacionado con su grupo (como un ranking, un promedio m√≥vil o una suma acumulada).

In [62]:
# ===================================================================
# PASO 4: EJECUTANDO CONSULTAS AVANZADAS
# ===================================================================

# 4.1. JOINs: Cruzando informaci√≥n para obtener respuestas completas. ## JOIN unir una tabla con otra
## LLAME E TABLA DE EMPLEADOS Y D TABLA DE DEPARTAMENTOS

print("üåâ --- INNER JOIN: ¬øQui√©n trabaja en qu√© departamento? ---")
query_inner = """
SELECT
    e.nombre,
    e.apellido,
    e.salario,
    e.fecha_ingreso,
    d.nombre_depto,
    d.region
FROM
    Empleados e 
INNER JOIN
    Departamentos d ON e.id_depto = d.id_depto; -- La condici√≥n que forma el puente
"""
ejecutar_sql(query_inner)

üåâ --- INNER JOIN: ¬øQui√©n trabaja en qu√© departamento? ---

   nombre   apellido  salario fecha_ingreso      nombre_depto   region
0     Ana     Garc√≠a  50000.0    2022-01-15        Tecnolog√≠a  Central
1    Luis   Mart√≠nez  75000.0    2021-11-20        Tecnolog√≠a  Central
2   Sof√≠a  Hern√°ndez  45000.0    2023-03-01            Ventas    Norte
3  Carlos      P√©rez  48000.0    2022-08-10            Ventas    Norte
4   Elena       Ruiz  82500.0    2020-05-01        Tecnolog√≠a  Central
5   Mario    Jim√©nez  35000.0    2023-05-15  Recursos Humanos  Central

In [56]:
print("\nüåâ --- LEFT JOIN: ¬øQu√© departamentos no tienen empleados? ---")
# El LEFT JOIN nos trae TODO de la tabla de la izquierda (Departamentos) y solo lo que coincida de la derecha (Empleados).
# Veremos que 'Marketing' aparece, pero con datos de empleado vac√≠os (NULL), ¬°porque nadie trabaja ah√≠ todav√≠a!
query_left = """
SELECT

    d.nombre_depto,
    d.region,
    e.nombre,
    e.apellido,
    e.salario,
    e.fecha_ingreso
FROM
    Departamentos d
LEFT JOIN
    Empleados e ON d.id_depto = e.id_depto;
"""
ejecutar_sql(query_left)

üåâ --- LEFT JOIN: ¬øQu√© departamentos no tienen empleados? ---

       nombre_depto   region  nombre   apellido  salario fecha_ingreso
0            Ventas    Norte  Carlos      P√©rez  48000.0    2022-08-10
1            Ventas    Norte   Sof√≠a  Hern√°ndez  45000.0    2023-03-01
2        Tecnolog√≠a  Central     Ana     Garc√≠a  50000.0    2022-01-15
3        Tecnolog√≠a  Central   Elena       Ruiz  82500.0    2020-05-01
4        Tecnolog√≠a  Central    Luis   Mart√≠nez  75000.0    2021-11-20
5  Recursos Humanos  Central   Mario    Jim√©nez  35000.0    2023-05-15
6         Marketing      Sur    None       None      NaN          None

In [57]:
query_right = """
SELECT

    d.nombre_depto,
    d.region,
    e.nombre,
    e.apellido,
    e.salario,
    e.fecha_ingreso
FROM
    Departamentos d
RIGHT JOIN
    Empleados e ON d.id_depto = e.id_depto;
"""
ejecutar_sql(query_right)

       nombre_depto   region  nombre   apellido  salario fecha_ingreso
0            Ventas    Norte   Sof√≠a  Hern√°ndez  45000.0    2023-03-01
1            Ventas    Norte  Carlos      P√©rez  48000.0    2022-08-10
2        Tecnolog√≠a  Central     Ana     Garc√≠a  50000.0    2022-01-15
3        Tecnolog√≠a  Central    Luis   Mart√≠nez  75000.0    2021-11-20
4        Tecnolog√≠a  Central   Elena       Ruiz  82500.0    2020-05-01
5  Recursos Humanos  Central   Mario    Jim√©nez  35000.0    2023-05-15
6              None     None   Julio  Jaramillo  80000.0    2025-01-01

In [63]:
## TRAIGAMETODO
query_outer = """
SELECT

    d.nombre_depto,
    d.region,
    e.nombre,
    e.apellido,
    e.salario,
    e.fecha_ingreso
FROM
    Departamentos d
FULL OUTER JOIN
    Empleados e ON d.id_depto = e.id_depto;
"""
ejecutar_sql(query_outer)

       nombre_depto   region  nombre   apellido  salario fecha_ingreso
0            Ventas    Norte   Sof√≠a  Hern√°ndez  45000.0    2023-03-01
1            Ventas    Norte  Carlos      P√©rez  48000.0    2022-08-10
2        Tecnolog√≠a  Central     Ana     Garc√≠a  50000.0    2022-01-15
3        Tecnolog√≠a  Central    Luis   Mart√≠nez  75000.0    2021-11-20
4        Tecnolog√≠a  Central   Elena       Ruiz  82500.0    2020-05-01
5  Recursos Humanos  Central   Mario    Jim√©nez  35000.0    2023-05-15
6         Marketing      Sur    None       None      NaN          None
7              None     None   Julio  Jaramillo  80000.0    2025-01-01

In [68]:
query_sin_cte = """
SELECT
    e.nombre,
    e.apellido,
    e.salario
FROM
    Empleados e
WHERE
    e.salario > (SELECT AVG(salario) from Empleados)
ORDER BY
    e.salario DESC;
"""
ejecutar_sql(query_sin_cte)

  nombre  apellido  salario
0  Elena      Ruiz  82500.0
1   Luis  Mart√≠nez  75000.0

In [ ]:
ejecutar_sql("SELECT AVG(salario) as avg_sal FROM Empleados") ## PROMEDIO DE LOS EMPLEADOS

   avg_sal
0  60100.0

In [70]:
# 4.2. CTEs: Escribiendo c√≥digo limpio y l√≥gico.
# Pregunta: ¬øQu√© empleados ganan m√°s que el promedio de toda la empresa?

print("üßë‚Äçüç≥ --- CTE: Encontrando empleados con salario superior al promedio ---")
# Primero, preparamos el ingrediente: calculamos el salario promedio en una CTE.
# Luego, cocinamos el plato principal: seleccionamos a los empleados compar√°ndolos con nuestro ingrediente.
query_cte = """
WITH SalarioPromedio AS (
    SELECT AVG(salario) as avg_sal
    FROM Empleados
)
SELECT
    e.nombre,
    e.apellido,
    e.salario
FROM
    Empleados e, SalarioPromedio sp
WHERE
    e.salario > sp.avg_sal
ORDER BY
    e.salario DESC;
"""
ejecutar_sql(query_cte)

üßë‚Äçüç≥ --- CTE: Encontrando empleados con salario superior al promedio ---

  nombre  apellido  salario
0  Elena      Ruiz  82500.0
1   Luis  Mart√≠nez  75000.0

In [71]:
# 4.3. Funciones de Ventana: An√°lisis en otro nivel. crear grupos rankings
# Pregunta: ¬øCu√°l es el ranking de salarios de los empleados DENTRO de su propio departamento?

print("üèÜ --- Funciones de Ventana: Ranking de salarios por departamento ---")
# PARTITION BY d.nombre_depto: Crea una "ventana" o grupo separado para cada departamento.
# ORDER BY e.salario DESC: Dentro de cada ventana, ordena a los empleados de mayor a menor salario.
# RANK(): Asigna el ranking seg√∫n ese orden. El c√°lculo se reinicia para cada nuevo departamento.
query_window = """
SELECT
    e.nombre,
    d.nombre_depto,
    e.salario,
    RANK() OVER (PARTITION BY d.nombre_depto ORDER BY e.salario DESC) as ranking_en_depto
FROM
    Empleados e
JOIN
    Departamentos d ON e.id_depto = d.id_depto;
"""
ejecutar_sql(query_window)

üèÜ --- Funciones de Ventana: Ranking de salarios por departamento ---

   nombre nombre_depto  salario  ranking_en_depto
0   Elena   Tecnolog√≠a  82500.0                 1
1    Luis   Tecnolog√≠a  75000.0                 2
2     Ana   Tecnolog√≠a  50000.0                 3
3  Carlos       Ventas  48000.0                 1
4   Sof√≠a       Ventas  45000.0                 2

## **5. Cierre de Laboratorio**

¬°Felicidades! Has completado un recorrido pr√°ctico por las capacidades m√°s importantes de SQL.

Como buena pr√°ctica, siempre que terminamos de trabajar con una base de datos, debemos cerrar la conexi√≥n. Esto libera los recursos y asegura que todos los cambios se hayan guardado correctamente en el archivo.

In [72]:
# Cerramos la conexi√≥n
conn.close()
print("Conexi√≥n a la base de datos cerrada.")

Conexi√≥n a la base de datos cerrada.